/*2353126 信03 崔露文*/
#include <iostream>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   4、整个程序不允许出现任何形式的循环
   --------------------------------------------------------------------- */

   /***************************************************************************
	 函数名称：convert
	 功    能：将整数n分解后输出
	 输入参数：int n(待分解)
	 返 回 值：
	 说    明：1、函数名、形参、返回类型均不准动
			   2、不允许使用64位整数
   ***************************************************************************/
void convert(int n)
{
	if (n == -2147483648) {
		convert(n / 10); // 除去最后一位，继续递归
		cout << "8 ";    // 输出最后一位数字
		return;
	}
	if (n < 0) {
		cout << "- ";
		n = -n;//如果是负数，则打印完负号后取它的绝对值再计算
	}
	if (n / 10 != 0)
	{
		convert(n / 10);
		//得到除了个位以外的其他位数，将商再传给函数(实现递归)。此时余数是个位数
	}
	cout << char(n % 10 + '0') << " ";
	//当传给函数的数为0或个位数时递归停止，开始输出，取余即使得每一次都输出当前数字的个位数
}

/***************************************************************************
  函数名称：main
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int n;
	cout << "请输入一个整数" << endl;
	cin >> n; //不考虑输入错误 

	convert(n);
	cout << endl;

	return 0;
}

